import matplotlib.pyplot as plt

########## Begin ##########
X=[-3.00,-2.70,-2.40,-2.10,-1.80,-1.50,-1.20,-0.90,-0.60,-0.30,0.00,0.30,0.60,0.90,1.20,1.50,1.80,2.10,2.40,2.70,3.00]
Y=[0.00,0.01,0.02,0.04,0.08,0.13,0.19,0.27,0.33,0.38,0.40,0.38,0.33,0.27,0.19,0.13,0.08,0.04,0.02,0.01,0.00]
########## End ##########

#以下代码用于打印结果
for i in range(len(X)):
    if round(X[i],2)==-0.0:
        X[i]=0
    print('%.2f\t%.2f' % (X[i],Y[i]))

#以下代码用于绘制图形
plt.plot(X,Y,'bo-')
plt.grid('on')
plt.axis([-3, 3, 0, 0.4])
plt.show()
plt.savefig( 'src/step6/student/pic.png' )
plt.close()